[
	
{"title":"Epic (2015)",
"imgSrc":"resources/epic.jpg",
"position":"Android Development Intern",
"description":"I added new annotation functionality to Haiku Android, Epic's mobile application for physicians, and I collaborated with two other interns to deliver inter-platform compatibility to Haiku on both iOS and Android.",
"bullets":
	["Developed an Android activity that allows physicians to create text and drawing annotations on images",
	"Utilized OpenCV for image processing to find reference objects, enabling distance measurements",
	"Designed application for cross-platform compatibility with iOS devices"]
},

{"title":"Swanson School of Engineering (2015)",
"imgSrc":"resources/benedum.jpg",
"position":"Researcher and Co-Author",
"description":"Quantifying the effects of radiation heat transfer in thermoelectric devices (TEDs) sheds light on the affects of different interconnect geometries on efficiency. I worked with MEMS instructor Matthew Barry to develop a program for determining the effects of radiation heat transfer in different TED structures",
"bullets":
	["Created a ray tracer to simulate thermal radiation in thermoelectric devices",
	"Utilized GPU acceleration to improve drastically the simulation's speed and precision",
	"Developed a web interface for remotely managing simulations using Java's HttpServer and Bootstrap",
	"Second author of Energy journal article \"Numerical Solution of Radiation View Factors within a Thermoelectric Device\" (under review)"]
},
	
	
{"title":"Epic (2014)",
"imgSrc":"resources/hyperspace.jpg",
"position":"Hyperspace Web Development Intern",
"description":"I ported a Visual Basic activity to ASP.NET, which involved creating a responsive web application compatible with modern browsers and working with Epic's JavaScript framework to add new features.",
"bullets":
	["Produced a secure, cross-browser compatible ASP.NET web application for clinicians",
	"Accessed Caché database in C# using Epic's ORM to store and retrieve sensitive data",
	"Collaborated with user experience designers to implement an intuitive, responsive user interface"]
},

{"title":"Tab Cleaner (2015)",
"imgSrc":"resources/chrome_extension.png",
"position":"Developer",
"description":"I developed a Chrome extension to clean up Chrome's new tab page.  Actively communicating with users and implementing their suggestions continues to be very rewarding.  Check out my Github page for the source code!",
"bullets":
	["Published a Chrome extension that allows for the customization and simplification of Chrome's new tab page",
	"Adhered to material design principles and actively interacted with users to improve usability"]
},

{"title":"Bentley Systems (2013)",
"imgSrc":"resources/bentley.png",
"position":"Software Development Intern",
"description":"I modified MicroStation source code to use enum classes and refactored legacy code.",
"bullets":
	["Modified MicroStation source to comply with C++11 standards using Python and regular expressions",
	"Refactored legacy code to improve maintainability"]
}
		
]